call task1(); -- повний автопарк
call task2_1(); -- перелік і загальне число водіїв 
call task2_2('Рута 23'); -- перелік і загальне число водіїв для зазначеної автомашині
call task3; -- водії по автомобілях
call task4; -- пасажирський автотранспорт по маршрутах
call task5_1('Автобус'); -- пробіг автотранспорту певної категорії 
call task5_2('Стрий Авто А0756', '2016-01-01', '2019-01-01'); -- пробіг автотранспорту конкретної автомашини за вказаний період 
call task6_1('Автобус'); -- число ремонтів та їх вартості для автотранспорту певної категорії
call task6_2('Рута'); -- число ремонтів та їх вартості для окремої марки автотранспорту 
call task6_3('Стрий Авто А075', '2016-07-06', '2020-08-06'); -- число ремонтів та їх вартості для вказаної автомашини за вказаний період
call task7('Альберт','Вескер'); -- підпорядкованість персоналу 
call task8_1(); -- відомості про наявність гаражного господарства 
call task8_2('Таксі'); -- відомості про наявність гаражного господарства по певній категорії транспорту
call task9(); -- розподіл автотранспорту на підприємстві
call task10('ГАЗ-51', '2015-07-06', '2020-08-06'); -- вантажоперевезення зазначеною автомашиною за встановлений період
call task11_1('двигун', 'Автобус'); -- число використаних для ремонту вказаних вузлів і агрегатів для транспорту певної категорії
call task11_2('двигун', 'Рута'); -- число використаних для ремонту вказаних вузлів і агрегатів для транспорту певної марки автотранспорту 
call task11_3('двигун', 'Богдан-3355', '2016-07-06', '2020-08-06'); -- число використаних для ремонту вказаних вузлів і агрегатів для конкретної автомашини за вказаний період
call task12('2015-07-23', '2020-08-23'); -- отримання та списання автотехніки за вказаний період
call task13('Олексій', 'Чижов'); -- склад підлеглих зазначеного бригадира тощо
call task14_1('Франц','Зайцев','Рута 22'); -- роботи виконані зазначеним фахівцем по конкретній автомашині
call task14_2('Ясон','Масляков','2015-01-01','2021-01-01'); -- роботи виконані зазначеним фахівцем за означений період 